Revit 2027 API
RebarInSystem.CanEditIndividualBars Method
 Checks if individual bars can be moved, excluded or included.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanEditIndividualBars()
Public Function CanEditIndividualBars As Boolean
public:
bool CanEditIndividualBars()
member CanEditIndividualBars : unit -> bool
Return Value
Boolean
 True if individual bars can be moved, excluded or included, false otherwise.
Remarks
 Individual bars can be moved, exlucded or included only for RebarInSystem that is owned by PathReinforcement. For RebarInSystem owned by AreaReinforcement these operations are not supported.
See Also
Reference
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace